[
    {
        "ID":0,
        "Title":"StarWars The empire strikes back",
        "Genres":["science fiction","actie"],
        "Actors":["Mark Hamill", "Harrison Ford", "Carrie Fisher"],
        "Length":124,
        "Description":"\"Star Wars: The Empire Strikes Back\" follows the Rebel Alliance as they are \nrelentlessly pursued by the sinister Galactic Empire. Luke Skywalker undergoes rigorous training \nwith Jedi Master Yoda, while Han Solo and Princess Leia evade Imperial forces",
        "Date": "2024-04-08T15:30:00"
    },
    {
        "ID":1,
        "Title": "Interstellar",
        "Genres": ["science fiction", "drama"],
        "Actors": ["Matthew McConaughey", "Anne Hathaway", "Jessica Chastain"],
        "Length": 169,
        "Description": "\"Interstellar\" depicts a near-future Earth on the brink of environmental collapse. \nA team of astronauts, led by a former NASA pilot, embarks on a daring mission through a wormhole \nnear Saturn to find a new habitable planet for humanity's survival, facing the vast unknowns of space and time.",
        "Date": "2024-04-09T15:30:00"
    },
    {
        "ID":2,
        "Title": "Back to the Future",
        "Genres": ["science fiction", "comedy"],
        "Actors": ["Michael J. Fox", "Christopher Lloyd", "Lea Thompson"],
        "Length": 116,
        "Description": "\"Back to the Future\" follows the adventures of Marty McFly, a teenager who is \naccidentally sent back in time to 1955 in a DeLorean time machine invented by his eccentric friend, \nDr. Emmett Brown. Marty must ensure his parents' budding romance while finding \na way to return to 1985, facing comedic mishaps and unforeseen consequences along the way.",
        "Date": "2024-04-10T15:30:00"
    },
    {
        "ID":3,
        "Title": "Toy Story",
        "Genres": ["animation", "comedy", "adventure"],
        "Actors": ["Tom Hanks", "Tim Allen", "Joan Cusack"],
        "Length": 81,
        "Description": "\"Toy Story\" follows the secret life of toys led by Woody, a pull-string \ncowboy doll, and Buzz Lightyear, a space ranger action figure. When Woody gets jealous of Buzz, they find \nthemselves lost and must work together to find their way back home to their owner, \nAndy, before he moves to a new house.",
        "Date": "1995-11-22T00:00:00"
    },
    {
        "ID":4,
        "Title": "Joker",
        "Genres": ["crime", "drama", "thriller"],
        "Actors": ["Joaquin Phoenix", "Robert De Niro", "Zazie Beetz"],
        "Length": 122,
        "Description": "\"Joker\" delves into the origin story of the iconic Batman villain, Arthur Fleck, \na failed stand-up comedian who descends into madness and becomes the criminal mastermind \nknown as the Joker. Set in Gotham City during the early 1980s, the film explores themes of mental illness, \nsocietal decay, and the consequences of violence.",
        "Date": "2019-10-04T00:00:00"
    },
    {
        "ID":5,
        "Title": "Inception",
        "Genres": ["science fiction", "action", "thriller"],
        "Actors": ["Leonardo DiCaprio", "Joseph Gordon-Levitt", "Ellen Page"],
        "Length": 148,
        "Description": "\"Inception\" follows Dom Cobb, a skilled thief who specializes in the dangerous \nart of extraction, stealing secrets from deep within the subconscious during dream states. \nCobb is offered a chance at redemption in exchange for one last job - the inception of an \nidea into the mind of a powerful businessman. As Cobb and his team navigate through layers \nof dreams within dreams, they face challenges and confront their own inner demons.",
        "Date": "2010-07-16T00:00:00"
    }
]